[" ", "(", ")", ".", "0", "1", "2", "3", "4", "5", "7", "8", "A", "B", "C", "D", "E", "F", "H", "I", "K", "L", "N", "O", "P", "S", "T", "U", "V", "X", "Z", "a", "ai", "an", "ang", "ao", "b", "ba", "bai", "ban", "bang", "bao", "bei", "ben", "beng", "bi", "bian", "biao", "bie", "bin", "bing", "bo", "bu", "c", "ca", "cai", "can", "cang", "cao", "ce", "ceng", "cha", "chai", "chan", "chang", "chao", "che", "chen", "cheng", "chi", "chong", "chou", "chu", "chuan", "chuang", "chui", "chun", "ci", "cong", "cu", "cui", "cun", "cuo", "d", "da", "dai", "dan", "dang", "dao", "de", "deng", "di", "dian", "diao", "die", "ding", "dong", "dou", "du", "duan", "dun", "duo", "e", "er", "fa", "fan", "fang", "fei", "fen", "feng", "fu", "ga", "gai", "gan", "gang", "gao", "ge", "gei", "gen", "geng", "gong", "gou", "gu", "gua", "guan", "guang", "gui", "gun", "guo", "h", "ha", "hai", "han", "hao", "he", "hei", "hong", "hou", "hu", "hua", "huai", "huan", "huang", "hui", "hun", "huo", "i", "ji", "jia", "jian", "jiang", "jiao", "jie", "jin", "jing", "jiu", "ju", "juan", "jun", "k", "ka", "kai", "kan", "kang", "kao", "ke", "ken", "kong", "kou", "ku", "kuai", "kuan", "kuang", "kui", "kun", "l", "la", "lai", "lan", "lang", "lao", "le", "lei", "leng", "li", "lian", "liang", "liao", "lin", "ling", "liu", "long", "lou", "lu", "lun", "luo", "lv", "ma", "mai", "man", "mang", "mao", "me", "mei", "men", "meng", "mi", "mian", "miao", "mie", "min", "ming", "mo", "mu", "n", "na", "nai", "nan", "nang", "nao", "nei", "neng", "ni", "nian", "niang", "niao", "nie", "ning", "niu", "nong", "nuan", "nuo", "nv", "o", "ou", "p", "pa", "pai", "pan", "pang", "pao", "pei", "pen", "peng", "pi", "pian", "piao", "pin", "ping", "po", "pu", "qi", "qian", "qiang", "qiao", "qin", "qing", "qiong", "qiu", "qu", "quan", "que", "qun", "ran", "rang", "re", "ren", "ri", "rong", "rou", "ru", "ruan", "rui", "run", "sa", "sai", "san", "sang", "sao", "se", "sha", "shai", "shan", "shang", "shao", "she", "shen", "sheng", "shi", "shou", "shu", "shua", "shuang", "shui", "shuo", "si", "song", "sou", "su", "suan", "sui", "sun", "suo", "t", "ta", "tai", "tan", "tang", "tao", "te", "teng", "ti", "tian", "tiao", "tie", "ting", "tong", "tou", "tu", "tuan", "tui", "tun", "tuo", "u", "wa", "wai", "wan", "wang", "wei", "wen", "wo", "wu", "x", "xi", "xia", "xian", "xiang", "xiao", "xie", "xin", "xing", "xiong", "xiu", "xu", "xuan", "xue", "xun", "ya", "yan", "yang", "yao", "ye", "yi", "yin", "ying", "yong", "you", "yu", "yuan", "yue", "yun", "z", "za", "zai", "zan", "zang", "zao", "zha", "zhan", "zhang", "zhao", "zhe", "zhen", "zheng", "zhi", "zhong", "zhou", "zhu", "zhuan", "zhuang", "zhuo", "zi", "zong", "zou", "zu", "zuan", "zui", "zuo", "\u3001", "\uff08", "\uff09", "\uff1a"]